["Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood Fullmetal Alchemist: Brotherhood  \"In order for something to be obtained, something of equal value must be lost.\"\n\r\nAlchemy is bound by this Law of Equivalent Exchange—something the young brothers Edward and Alphonse Elric only realize after attempting human transmutation: the one forbidden act of alchemy. They pay a terrible price for their transgression—Edward loses his left leg, Alphonse his physical body. It is only by the desperate sacrifice of Edward's right arm that he is able to affix Alphonse's soul to a suit of armor. Devastated and alone, it is the hope that they would both eventually return to their original bodies that gives Edward the inspiration to obtain metal limbs called \"automail\" and become a state alchemist, the Fullmetal Alchemist.\n\r\nThree years of searching later, the brothers seek the Philosopher's Stone, a mythical relic that allows an alchemist to overcome the Law of Equivalent Exchange. Even with military allies Colonel Roy Mustang, Lieutenant Riza Hawkeye, and Lieutenant Colonel Maes Hughes on their side, the brothers find themselves caught up in a nationwide conspiracy that leads them not only to the true nature of the elusive Philosopher's Stone, but their country's murky history as well. In between finding a serial killer and racing against time, Edward and Alphonse must ask themselves if what they are doing will make them human again... or take away their humanity.\n\r\n[Written by MAL Rewrite]\nEnglish: Fullmetal Alchemist: Brotherhood\n  \nSynonyms: Hagane no Renkinjutsushi: Fullmetal Alchemist, Fullmetal Alchemist (2009), FMA, FMAB\n  \nJapanese: 鋼の錬金術師 FULLMETAL ALCHEMIST\n       Elric, Edward Elric, Edward Elric, Edward Elric, Edward Elric, Edward Park, Romi Park, Romi Park, Romi Park, Romi Park, Romi           Elric, Alphonse Elric, Alphonse Elric, Alphonse Elric, Alphonse Elric, Alphonse Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Mustang, Roy Mustang, Roy Mustang, Roy Mustang, Roy Mustang, Roy Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro           Hughes, Maes Hughes, Maes Hughes, Maes Hughes, Maes Hughes, Maes Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji           Greed Greed Greed Greed Greed Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi           Hawkeye, Riza Hawkeye, Riza Hawkeye, Riza Hawkeye, Riza Hawkeye, Riza Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko           Yao, Ling Yao, Ling Yao, Ling Yao, Ling Yao, Ling Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru           Armstrong, Alex Louis Armstrong, Alex Louis Armstrong, Alex Louis Armstrong, Alex Louis Armstrong, Alex Louis Utsumi, Kenji Utsumi, Kenji Utsumi, Kenji Utsumi, Kenji Utsumi, Kenji           Rockbell, Winry Rockbell, Winry Rockbell, Winry Rockbell, Winry Rockbell, Winry Takamoto, Megumi Takamoto, Megumi Takamoto, Megumi Takamoto, Megumi Takamoto, Megumi           Armstrong, Olivier Mira Armstrong, Olivier Mira Armstrong, Olivier Mira Armstrong, Olivier Mira Armstrong, Olivier Mira Soumi, Yoko Soumi, Yoko Soumi, Yoko Soumi, Yoko Soumi, Yoko           Cook, Justin Cook, Justin Cook, Justin Cook, Justin Cook, Justin      Irie, Yasuhiro Irie, Yasuhiro Irie, Yasuhiro Irie, Yasuhiro Irie, Yasuhiro      Mima, Masafumi Mima, Masafumi Mima, Masafumi Mima, Masafumi Mima, Masafumi      Sueda, Yoshifumi Sueda, Yoshifumi Sueda, Yoshifumi Sueda, Yoshifumi Sueda, Yoshifumi #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #1: \"again\" by YUI (eps 1-14) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #2: \"Hologram (ホログラム)\" by NICO Touches the Walls (eps 15-26) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #3: \"Golden Time Lover (ゴールデンタイムラバー)\" by Sukima Switch (eps 27-38) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #4: \"Period\" by Chemistry (eps 39-50) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #5: \"Rain (レイン)\" by SID (eps 51-62) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #1: \"Uso (嘘)\" by SID (eps 1-14) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #2: \"LET IT OUT\" by Miho Fukuhara (eps 15-26) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #3: \"Tsunaida Te (つないだ手)\" by Lil'B (eps 27-38) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #4: \"Shunkan Sentimental (瞬間センチメンタル)\" by SCANDAL (eps 39-50) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #5: \"RAY OF LIGHT\" by Nakagawa Shouko (eps 51-62) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #6: \"Rain (レイン)\" by SID (ep 63) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) #7: \"Hologram (ホログラム)\" by NICO Touches the Walls (ep 64) Aniplex Aniplex Aniplex Aniplex Aniplex Square Enix Square Enix Square Enix Square Enix Square Enix Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Studio Moriken Studio Moriken Studio Moriken Studio Moriken Studio Moriken Funimation Funimation Funimation Funimation Funimation Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America Bones Bones Bones Bones Bones Action Action Action Action Action Military Military Military Military Military Adventure Adventure Adventure Adventure Adventure Comedy Comedy Comedy Comedy Comedy Drama Drama Drama Drama Drama Magic Magic Magic Magic Magic Fantasy Fantasy Fantasy Fantasy Fantasy Shounen Shounen Shounen Shounen Shounen Bones Bones Bones Bones Bones ", "Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate Steins;Gate  The self-proclaimed mad scientist Rintarou Okabe rents out a room in a rickety old building in Akihabara, where he indulges himself in his hobby of inventing prospective \"future gadgets\" with fellow lab members: Mayuri Shiina, his air-headed childhood friend, and Hashida Itaru, a perverted hacker nicknamed \"Daru.\" The three pass the time by tinkering with their most promising contraption yet, a machine dubbed the \"Phone Microwave,\" which performs the strange function of morphing bananas into piles of green gel.\n\r\nThough miraculous in itself, the phenomenon doesn't provide anything concrete in Okabe's search for a scientific breakthrough; that is, until the lab members are spurred into action by a string of mysterious happenings before stumbling upon an unexpected success—the Phone Microwave can send emails to the past, altering the flow of history.\n\r\nAdapted from the critically acclaimed visual novel by 5pb. and Nitroplus, Steins;Gate takes Okabe through the depths of scientific theory and practicality. Forced across the diverging threads of past and present, Okabe must shoulder the burdens that come with holding the key to the realm of time.\n\r\n[Written by MAL Rewrite]\nEnglish: Steins;Gate\n  \nJapanese: STEINS;GATE\n       Okabe, Rintarou Okabe, Rintarou Okabe, Rintarou Okabe, Rintarou Okabe, Rintarou Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru           Makise, Kurisu Makise, Kurisu Makise, Kurisu Makise, Kurisu Makise, Kurisu Imai, Asami Imai, Asami Imai, Asami Imai, Asami Imai, Asami           Shiina, Mayuri Shiina, Mayuri Shiina, Mayuri Shiina, Mayuri Shiina, Mayuri Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana           Hashida, Itaru Hashida, Itaru Hashida, Itaru Hashida, Itaru Hashida, Itaru Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu           Amane, Suzuha Amane, Suzuha Amane, Suzuha Amane, Suzuha Amane, Suzuha Tamura, Yukari Tamura, Yukari Tamura, Yukari Tamura, Yukari Tamura, Yukari           Urushibara, Ruka Urushibara, Ruka Urushibara, Ruka Urushibara, Ruka Urushibara, Ruka Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu           Akiha, Rumiho Akiha, Rumiho Akiha, Rumiho Akiha, Rumiho Akiha, Rumiho Momoi, Haruko Momoi, Haruko Momoi, Haruko Momoi, Haruko Momoi, Haruko           Kiryuu, Moeka Kiryuu, Moeka Kiryuu, Moeka Kiryuu, Moeka Kiryuu, Moeka Gotou, Saori Gotou, Saori Gotou, Saori Gotou, Saori Gotou, Saori           Tennouji, Yuugo Tennouji, Yuugo Tennouji, Yuugo Tennouji, Yuugo Tennouji, Yuugo Terasoma, Masaki Terasoma, Masaki Terasoma, Masaki Terasoma, Masaki Terasoma, Masaki           Tennouji, Nae Tennouji, Nae Tennouji, Nae Tennouji, Nae Tennouji, Nae Yamamoto, Ayano Yamamoto, Ayano Yamamoto, Ayano Yamamoto, Ayano Yamamoto, Ayano           Iwasa, Gaku Iwasa, Gaku Iwasa, Gaku Iwasa, Gaku Iwasa, Gaku      Yasuda, Takeshi Yasuda, Takeshi Yasuda, Takeshi Yasuda, Takeshi Yasuda, Takeshi      Hamasaki, Hiroshi Hamasaki, Hiroshi Hamasaki, Hiroshi Hamasaki, Hiroshi Hamasaki, Hiroshi      Satou, Takuya Satou, Takuya Satou, Takuya Satou, Takuya Satou, Takuya \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou \"Hacking to the Gate\" by Kanako Itou #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #1: \"Toki Tsukasadoru Juuni no Meiyaku (刻司ル十二ノ盟約)\" by Yui Sakakibara (eps 1-21) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #2: \"Fake Verthandi\" by Takeshi Abo (ep 22) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #3: \"Sky Clad no Kansokusha (スカイクラッドの観測者)\" by Kanako Itou (ep 23) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) #4: \"Another Heaven\" by Kanako Itou (ep 24) Frontier Works Frontier Works Frontier Works Frontier Works Frontier Works Media Factory Media Factory Media Factory Media Factory Media Factory Movic Movic Movic Movic Movic AT-X AT-X AT-X AT-X AT-X Kadokawa Pictures Japan Kadokawa Pictures Japan Kadokawa Pictures Japan Kadokawa Pictures Japan Kadokawa Pictures Japan Nitroplus Nitroplus Nitroplus Nitroplus Nitroplus Funimation Funimation Funimation Funimation Funimation White Fox White Fox White Fox White Fox White Fox Thriller Thriller Thriller Thriller Thriller Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi White Fox White Fox White Fox White Fox White Fox ", "Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama° Gintama°  Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko?\n\r\nMeanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team.\n\r\nFilled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet.\n\r\n[Written by MAL Rewrite]\nEnglish: Gintama Season 4\n  \nSynonyms: Gintama' (2015)\n  \nJapanese: 銀魂°\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Kamui Kamui Kamui Kamui Kamui Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi           Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru      Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji      Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #1: \"DAY×DAY\" by BLUE ENCOUNT (eps 1-12) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #2: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (eps 13-15, 17-26) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #3: \"Saigo made II (最後までⅡ)\" by Aqua Timez (ep 16) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #4: \"Beautiful Days\" by OKAMOTO'S (eps 27-38) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #5: ''Know Know Know'' by DOES (eps 39-50) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #6: \"Acchi Muite (あっちむいて)\" by Swimy (ep 51) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #1: \"DESTINY\" by Negoto (eps 1-12) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #2: \"Saigo made II (最後までⅡ)\" by Aqua Timez (eps 13-15, 17-26) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #3: \"Pride Kakumei (プライド革命)\" by CHiCO with HoneyWorks (ep 16) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #4: \"Glorious Days (グロリアスデイズ)\" by THREE LIGHTS DOWN KINGS (eps 27-38) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #5: \"Acchi Muite (あっちむいて)\" by Swimy (eps 39-50) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) #6: \"Know Know Know\" by DOES (ep 51) TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Funimation Funimation Funimation Funimation Funimation Crunchyroll Crunchyroll Crunchyroll Crunchyroll Crunchyroll Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Action Action Action Action Action Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Shounen Shounen Shounen Shounen Shounen Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures ", "Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011) Hunter x Hunter (2011)  Hunter x Hunter is set in a world where Hunters exist to perform all manner of dangerous tasks like capturing criminals and bravely searching for lost treasures in uncharted territories. Twelve-year-old Gon Freecss is determined to become the best Hunter possible in hopes of finding his father, who was a Hunter himself and had long ago abandoned his young son. However, Gon soon realizes the path to achieving his goals is far more challenging than he could have ever imagined.\n\r\nAlong the way to becoming an official Hunter, Gon befriends the lively doctor-in-training Leorio, vengeful Kurapika, and rebellious ex-assassin Killua. To attain their own goals and desires, together the four of them take the Hunter Exam, notorious for its low success rate and high probability of death. Throughout their journey, Gon and his friends embark on an adventure that puts them through many hardships and struggles. They will meet a plethora of monsters, creatures, and characters—all while learning what being a Hunter truly means.\n\r\n[Written by MAL Rewrite]\nEnglish: Hunter x Hunter\n  \nSynonyms: HxH (2011)\n  \nJapanese: HUNTER×HUNTER（ハンター×ハンター）\n       Zoldyck, Killua Zoldyck, Killua Zoldyck, Killua Zoldyck, Killua Zoldyck, Killua Ise, Mariya Ise, Mariya Ise, Mariya Ise, Mariya Ise, Mariya           Freecss, Gon Freecss, Gon Freecss, Gon Freecss, Gon Freecss, Gon Han, Megumi Han, Megumi Han, Megumi Han, Megumi Han, Megumi           Kurapika Kurapika Kurapika Kurapika Kurapika Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki           Paladiknight, Leorio Paladiknight, Leorio Paladiknight, Leorio Paladiknight, Leorio Paladiknight, Leorio Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji Fujiwara, Keiji           Morow, Hisoka Morow, Hisoka Morow, Hisoka Morow, Hisoka Morow, Hisoka Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke           Meruem Meruem Meruem Meruem Meruem Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki           Lucilfer, Chrollo Lucilfer, Chrollo Lucilfer, Chrollo Lucilfer, Chrollo Lucilfer, Chrollo Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru Miyano, Mamoru           Netero, Isaac Netero, Isaac Netero, Isaac Netero, Isaac Netero, Isaac Ginga, Banjou Ginga, Banjou Ginga, Banjou Ginga, Banjou Ginga, Banjou           Neferpitou Neferpitou Neferpitou Neferpitou Neferpitou Fujimura, Ayumi Fujimura, Ayumi Fujimura, Ayumi Fujimura, Ayumi Fujimura, Ayumi           Pohtoh, Feitan Pohtoh, Feitan Pohtoh, Feitan Pohtoh, Feitan Pohtoh, Feitan Yamaguchi, Kappei Yamaguchi, Kappei Yamaguchi, Kappei Yamaguchi, Kappei Yamaguchi, Kappei           Maruyama, Masao Maruyama, Masao Maruyama, Masao Maruyama, Masao Maruyama, Masao      Nakatani, Toshio Nakatani, Toshio Nakatani, Toshio Nakatani, Toshio Nakatani, Toshio      Koujina, Hiroshi Koujina, Hiroshi Koujina, Hiroshi Koujina, Hiroshi Koujina, Hiroshi      Yamada, Chiaki Yamada, Chiaki Yamada, Chiaki Yamada, Chiaki Yamada, Chiaki #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #1: \"departure!\" by Ono Masatoshi (eps 1-26, 50-52, 62-75, 137-147) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #2: \"departure! -second version-\" by Ono Masatoshi (eps 27-49, 76-103, 109-134, 136) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #3: \"departure! -Opening Tokubetsu-hen-\" by Ono Masatoshi (eps 53-61, 104-108) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #1: \"Just Awake\" by Fear, and Loathing in Las Vegas (eps 1-26) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #2: \"HUNTING FOR YOUR DREAM\" by Galneryus (eps 27-50, 52-58) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #3: \"Riot\" by Yoshihisa Hirano (ep 51) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #4: \"REASON\" by YUZU (ゆず) (eps 59-75, 147) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #5: \"Nagareboshi Kirari (YUZU Version) (流れ星キラリ (ゆずバージョン))\" by YUZU (ゆず) (eps 76-98) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #6: \"Hyouriittai (表裏一体)\" by YUZU (ゆず) (eps 99-134, 136) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #7: \"Understanding\" by Yoshihisa Hirano (ep 135) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #8: \"Hyouriittai -second version- (表裏一体)\" by YUZU (ゆず) (eps 137-146) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) #9: \"departure!\" by Ono Masatoshi (ep 148) VAP VAP VAP VAP VAP Nippon Television Network Nippon Television Network Nippon Television Network Nippon Television Network Nippon Television Network Shueisha Shueisha Shueisha Shueisha Shueisha Viz Media Viz Media Viz Media Viz Media Viz Media Madhouse Madhouse Madhouse Madhouse Madhouse Action Action Action Action Action Adventure Adventure Adventure Adventure Adventure Fantasy Fantasy Fantasy Fantasy Fantasy Shounen Shounen Shounen Shounen Shounen Super Power Super Power Super Power Super Power Super Power Madhouse Madhouse Madhouse Madhouse Madhouse ", "Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu Ginga Eiyuu Densetsu  The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli.\n\r\nWhile Reinhard climbs the ranks of the Empire with the aid of his childhood friend, Siegfried Kircheis, he must fight not only the war, but also the remnants of the crumbling Goldenbaum Dynasty in order to free his sister from the Kaiser and unify humanity under one genuine ruler. Meanwhile, on the other side of the galaxy, Yang—a strong supporter of democratic ideals—has to stand firm in his beliefs, despite the struggles of the FPA, and show his pupil, Julian Mintz, that autocracy is not the solution.\n\r\nAs ideologies clash amidst the war's many casualties, the two strategic masterminds must ask themselves what the real reason behind their battle is.\n\r\n[Written by MAL Rewrite]\nEnglish: Legend of the Galactic Heroes\n  \nSynonyms: LoGH, LotGH, Gin'eiden, GinEiDen, Heldensagen Vom Kosmosinsel\n  \nJapanese: 銀河英雄伝説\n       Yang, Wen-li Yang, Wen-li Yang, Wen-li Yang, Wen-li Yang, Wen-li Tomiyama, Kei Tomiyama, Kei Tomiyama, Kei Tomiyama, Kei Tomiyama, Kei           von Lohengramm, Reinhard von Lohengramm, Reinhard von Lohengramm, Reinhard von Lohengramm, Reinhard von Lohengramm, Reinhard Horikawa, Ryo Horikawa, Ryo Horikawa, Ryo Horikawa, Ryo Horikawa, Ryo           von Reuenthal, Oskar von Reuenthal, Oskar von Reuenthal, Oskar von Reuenthal, Oskar von Reuenthal, Oskar Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio           von Oberstein, Paul von Oberstein, Paul von Oberstein, Paul von Oberstein, Paul von Oberstein, Paul Shiozawa, Kaneto Shiozawa, Kaneto Shiozawa, Kaneto Shiozawa, Kaneto Shiozawa, Kaneto           Kircheis, Siegfried Kircheis, Siegfried Kircheis, Siegfried Kircheis, Siegfried Kircheis, Siegfried Hironaka, Masashi Hironaka, Masashi Hironaka, Masashi Hironaka, Masashi Hironaka, Masashi           von Schönkopf, Walter von Schönkopf, Walter von Schönkopf, Walter von Schönkopf, Walter von Schönkopf, Walter Hazama, Michio Hazama, Michio Hazama, Michio Hazama, Michio Hazama, Michio           Mittermeyer, Wolfgang Mittermeyer, Wolfgang Mittermeyer, Wolfgang Mittermeyer, Wolfgang Mittermeyer, Wolfgang Mori, Katsuji Mori, Katsuji Mori, Katsuji Mori, Katsuji Mori, Katsuji           von Mariendorf, Hildegard von Mariendorf, Hildegard von Mariendorf, Hildegard von Mariendorf, Hildegard von Mariendorf, Hildegard Katsuki, Masako Katsuki, Masako Katsuki, Masako Katsuki, Masako Katsuki, Masako           Minci, Julian Minci, Julian Minci, Julian Minci, Julian Minci, Julian Sasaki, Nozomu Sasaki, Nozomu Sasaki, Nozomu Sasaki, Nozomu Sasaki, Nozomu           Attenborough, Dusty Attenborough, Dusty Attenborough, Dusty Attenborough, Dusty Attenborough, Dusty Inoue, Kazuhiko Inoue, Kazuhiko Inoue, Kazuhiko Inoue, Kazuhiko Inoue, Kazuhiko           Ishiguro, Noboru Ishiguro, Noboru Ishiguro, Noboru Ishiguro, Noboru Ishiguro, Noboru      Aketagawa, Susumu Aketagawa, Susumu Aketagawa, Susumu Aketagawa, Susumu Aketagawa, Susumu      Motonaga, Keitarou Motonaga, Keitarou Motonaga, Keitarou Motonaga, Keitarou Motonaga, Keitarou      Imaizumi, Kenichi Imaizumi, Kenichi Imaizumi, Kenichi Imaizumi, Kenichi Imaizumi, Kenichi #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #1: \"Skies of Love\" by Michiru Akiyoshi (eps 1-22,24-26) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #2: \"I am waiting for you\" by Michiru Akiyoshi (eps 27-30,32,34-35,37-38,40,43,45,49,51-52) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #3: \"Sea of the Stars\" by LISA (eps 55-81,86) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #4: \"Must Be Something\" by Hitomi Konno (eps 87-106,108-110) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #1: \"Hikari no Hashi wo koete\" by Kei Ogura (eps 1-5,7-13,16-17,19-21,24-26,84) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #2: \"Tabidachi no Jyokyoku\" by Kei Ogura (eps 27-30,32,35,37-38,40,42-43,45,49,51) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #3: \"Kansou no Uta\" by Kei Ogura (eps 55-56,58-69,71-81,83,85) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) #4: \"Uchuu no Kakehashi\" by Kei Ogura (eps 87-106,108-110) Kitty Films Kitty Films Kitty Films Kitty Films Kitty Films K-Factory K-Factory K-Factory K-Factory K-Factory Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Artland Artland Artland Artland Artland Magic Bus Magic Bus Magic Bus Magic Bus Magic Bus Military Military Military Military Military Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Space Space Space Space Space Drama Drama Drama Drama Drama Artland Artland Artland Artland Artland Magic Bus Magic Bus Magic Bus Magic Bus Magic Bus ", "Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama' Gintama'  After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child.\n\r\nBewildered, Shinpachi agrees to join the Shinsengumi at Otae and Kondou's request and finds even more startling transformations afoot both in and out of the ranks of the the organization. However, discovering that Vice Chief Toushirou Hijikata has remained unchanged, Shinpachi and his unlikely Shinsengumi ally set out to return the city of Edo to how they remember it.\n\r\nWith even more dirty jokes, tongue-in-cheek parodies, and shameless references, Gintama' follows the Yorozuya team through more of their misadventures in the vibrant, alien-filled world of Edo.\n\r\n[Written by MAL Rewrite]\n\nEnglish: Gintama Season 2\n  \nSynonyms: Gintama (2011)\n  \nJapanese: 銀魂'\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Kamui Kamui Kamui Kamui Kamui Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi           Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi      Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai Yoshimura, Ai      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #1: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (eps 1-26) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #2: \"Dilemma (ジレンマ)\" by ecosystem (eps 27-39) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #3: \"Wonderland (ワンダーランド)\" by FLiP (eps 40-51) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #1: \"Samurai Heart (Some Like It Hot!!)\" by SPYAIR (eps 1-13) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #2: \"Balance Doll (バランスドール)\" by Prague (eps 14-26) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #3: \"Anagura (アナグラ)\" by Kuroneko Chelsea (eps 27-39) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #4: \"Nakama (仲間)\" by Good Coming (eps 40-50) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) #5: \"Tougenkyou Alien (桃源郷エイリアン)\" by serial TV drama (ep 51) TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Trinity Sound Trinity Sound Trinity Sound Trinity Sound Trinity Sound Miracle Robo Miracle Robo Miracle Robo Miracle Robo Miracle Robo Studio Jack Studio Jack Studio Jack Studio Jack Studio Jack Shueisha Shueisha Shueisha Shueisha Shueisha add some add some add some add some add some Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Shounen Shounen Shounen Shounen Shounen Sunrise Sunrise Sunrise Sunrise Sunrise ", "Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2 Shingeki no Kyojin Season 3 Part 2  Seeking to restore humanity’s diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless \"Titans\" takes the stage once again. \n\r\nReturning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. \n\nShingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement.\n\r\n[Written by MAL Rewrite]\nEnglish: Attack on Titan Season 3 Part 2\n  \nJapanese: 進撃の巨人 Season3 Part.2\n       Levi Levi Levi Levi Levi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi           Ackerman, Mikasa Ackerman, Mikasa Ackerman, Mikasa Ackerman, Mikasa Ackerman, Mikasa Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui           Yeager, Eren Yeager, Eren Yeager, Eren Yeager, Eren Yeager, Eren Kaji, Yuki Kaji, Yuki Kaji, Yuki Kaji, Yuki Kaji, Yuki           Arlert, Armin Arlert, Armin Arlert, Armin Arlert, Armin Arlert, Armin Inoue, Marina Inoue, Marina Inoue, Marina Inoue, Marina Inoue, Marina           Smith, Erwin Smith, Erwin Smith, Erwin Smith, Erwin Smith, Erwin Ono, Daisuke Ono, Daisuke Ono, Daisuke Ono, Daisuke Ono, Daisuke           Zoë, Hange Zoë, Hange Zoë, Hange Zoë, Hange Zoë, Hange Park, Romi Park, Romi Park, Romi Park, Romi Park, Romi           Blouse, Sasha Blouse, Sasha Blouse, Sasha Blouse, Sasha Blouse, Sasha Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu           Leonhart, Annie Leonhart, Annie Leonhart, Annie Leonhart, Annie Leonhart, Annie Shimamura, Yuu Shimamura, Yuu Shimamura, Yuu Shimamura, Yuu Shimamura, Yuu           Kirstein, Jean Kirstein, Jean Kirstein, Jean Kirstein, Jean Kirstein, Jean Taniyama, Kishou Taniyama, Kishou Taniyama, Kishou Taniyama, Kishou Taniyama, Kishou           Lenz, Krista Lenz, Krista Lenz, Krista Lenz, Krista Lenz, Krista Mikami, Shiori Mikami, Shiori Mikami, Shiori Mikami, Shiori Mikami, Shiori           Yabuta, Shuuhei Yabuta, Shuuhei Yabuta, Shuuhei Yabuta, Shuuhei Yabuta, Shuuhei      Wada, Jouji Wada, Jouji Wada, Jouji Wada, Jouji Wada, Jouji      Morishita, Katsuji Morishita, Katsuji Morishita, Katsuji Morishita, Katsuji Morishita, Katsuji      Araki, Tetsurou Araki, Tetsurou Araki, Tetsurou Araki, Tetsurou Araki, Tetsurou \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Shoukei to Shikabane no Michi (憧憬と屍の道)\" by Linked Horizon \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff \"Name of Love\" by Cinema Staff Production I.G Production I.G Production I.G Production I.G Production I.G Dentsu Dentsu Dentsu Dentsu Dentsu Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Pony Canyon Pony Canyon Pony Canyon Pony Canyon Pony Canyon Kodansha Kodansha Kodansha Kodansha Kodansha Techno Sound Techno Sound Techno Sound Techno Sound Techno Sound Pony Canyon Enterprise Pony Canyon Enterprise Pony Canyon Enterprise Pony Canyon Enterprise Pony Canyon Enterprise Funimation Funimation Funimation Funimation Funimation Wit Studio Wit Studio Wit Studio Wit Studio Wit Studio Action Action Action Action Action Military Military Military Military Military Mystery Mystery Mystery Mystery Mystery Super Power Super Power Super Power Super Power Super Power Drama Drama Drama Drama Drama Fantasy Fantasy Fantasy Fantasy Fantasy Shounen Shounen Shounen Shounen Shounen Wit Studio Wit Studio Wit Studio Wit Studio Wit Studio ", "Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen Gintama': Enchousen  While Gintoki Sakata was away, the Yorozuya found themselves a new leader: Kintoki, Gintoki's golden-haired doppelganger. In order to regain his former position, Gintoki will need the help of those around him, a troubling feat when no one can remember him! Between Kintoki and Gintoki, who will claim the throne as the main character?\n\r\nIn addition, Yorozuya make a trip back down to red-light district of Yoshiwara to aid an elderly courtesan in her search for her long-lost lover. Although the district is no longer in chains beneath the earth's surface, the trio soon learn of the tragic backstories of Yoshiwara's inhabitants that still haunt them. With flashback after flashback, this quest has Yorozuya witnessing everlasting love and protecting it as best they can with their hearts and souls.\n\nGintama': Enchousen includes moments of action-packed intensity along with their usual lighthearted, slapstick humor for Gintoki and his friends.\n\r\n[Written by MAL Rewrite]\nEnglish: Gintama: Enchousen\n  \nSynonyms: Gintama' (2012), Gintama' Overdrive, Kintama\n  \nJapanese: 銀魂' 延長戦\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Elizabeth Elizabeth Elizabeth Elizabeth Elizabeth      Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru      Yokote, Michiko Yokote, Michiko Yokote, Michiko Yokote, Michiko Yokote, Michiko      Shimoyama, Kento Shimoyama, Kento Shimoyama, Kento Shimoyama, Kento Shimoyama, Kento #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #1: \"LET'S GO OUT\" by Amoyamo (eps 1-3) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #2: \"Mantama (まんたま)\" by Tsu Terakado ♀ with Houkago Happy Hour (寺門通♀ with 放課後ハッピーアワー) (ep 4) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #3: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (eps 5-8, 10-13) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #4: \"Expect (エクスペクト)\" by Page (ep 9) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #1: \"Moonwalk (ムーンウォーク)\" by Monobright (eps 1-4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #2: \"LET'S GO OUT\" by Amoyamo (ep 4) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #3: \"Expect (エクスペクト)\" by Page (eps 5-8, 10-13) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) #4: \"Sakura Mitsutsuki (サクラミツツキ)\" by Spyair (ep 9) TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Shueisha Shueisha Shueisha Shueisha Shueisha Miracle Bus Miracle Bus Miracle Bus Miracle Bus Miracle Bus add some add some add some add some add some Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Shounen Shounen Shounen Shounen Shounen Sunrise Sunrise Sunrise Sunrise Sunrise ", "3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season 3-gatsu no Lion 2nd Season  Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. \n\r\nNonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career.\n\r\n[Written by MAL Rewrite]\nEnglish: March Comes In Like A Lion 2nd Season\n  \nSynonyms: Sangatsu no Lion Second Season\n  \nJapanese: 3月のライオン 第2シリーズ\n       Kiriyama, Rei Kiriyama, Rei Kiriyama, Rei Kiriyama, Rei Kiriyama, Rei Kawanishi, Kengo Kawanishi, Kengo Kawanishi, Kengo Kawanishi, Kengo Kawanishi, Kengo           Kawamoto, Hinata Kawamoto, Hinata Kawamoto, Hinata Kawamoto, Hinata Kawamoto, Hinata Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana           Kawamoto, Akari Kawamoto, Akari Kawamoto, Akari Kawamoto, Akari Kawamoto, Akari Kayano, Ai Kayano, Ai Kayano, Ai Kayano, Ai Kayano, Ai           Kawamoto, Momo Kawamoto, Momo Kawamoto, Momo Kawamoto, Momo Kawamoto, Momo Kuno, Misaki Kuno, Misaki Kuno, Misaki Kuno, Misaki Kuno, Misaki           Shimada, Kai Shimada, Kai Shimada, Kai Shimada, Kai Shimada, Kai Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro           Nikaidou, Harunobu Nikaidou, Harunobu Nikaidou, Harunobu Nikaidou, Harunobu Nikaidou, Harunobu Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko           Kouda, Kyouko Kouda, Kyouko Kouda, Kyouko Kouda, Kyouko Kouda, Kyouko Inoue, Marina Inoue, Marina Inoue, Marina Inoue, Marina Inoue, Marina           Hayashida, Takashi Hayashida, Takashi Hayashida, Takashi Hayashida, Takashi Hayashida, Takashi Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro           Souya, Touji Souya, Touji Souya, Touji Souya, Touji Souya, Touji Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Yanagihara, Sakutarou Yanagihara, Sakutarou Yanagihara, Sakutarou Yanagihara, Sakutarou Yanagihara, Sakutarou Ootsuka, Houchuu Ootsuka, Houchuu Ootsuka, Houchuu Ootsuka, Houchuu Ootsuka, Houchuu           Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki      Okada, Kenjirou Okada, Kenjirou Okada, Kenjirou Okada, Kenjirou Okada, Kenjirou      Takatsu, Yukio Takatsu, Yukio Takatsu, Yukio Takatsu, Yukio Takatsu, Yukio      Nakamura, Ryousuke Nakamura, Ryousuke Nakamura, Ryousuke Nakamura, Ryousuke Nakamura, Ryousuke #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #1: \"Flag wo Tatero (フラッグを立てろ)\" by YUKI (eps 1-11) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #2: \"Haru ga Kite Bokura (春が来てぼくら)\" by UNISON SQUARE GARDEN (eps 12-22) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #1: \"Kafune (カフネ)\" by Brian the Sun (eps 1-11) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) #2: \"I AM STANDING\" by RUANN (eps 12-22) Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu NHK NHK NHK NHK NHK Hakusensha Hakusensha Hakusensha Hakusensha Hakusensha Asmik Ace Asmik Ace Asmik Ace Asmik Ace Asmik Ace Toy's Factory Toy's Factory Toy's Factory Toy's Factory Toy's Factory Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America Shaft Shaft Shaft Shaft Shaft Drama Drama Drama Drama Drama Game Game Game Game Game Seinen Seinen Seinen Seinen Seinen Slice of Life Slice of Life Slice of Life Slice of Life Slice of Life Shaft Shaft Shaft Shaft Shaft ", "Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi Koe no Katachi  As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\r\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n\r\n[Written by MAL Rewrite]\nEnglish: A Silent Voice\n  \nSynonyms: The Shape of Voice\n  \nJapanese: 聲の形\n       Nishimiya, Shouko Nishimiya, Shouko Nishimiya, Shouko Nishimiya, Shouko Nishimiya, Shouko Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori           Ishida, Shouya Ishida, Shouya Ishida, Shouya Ishida, Shouya Ishida, Shouya Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu           Nishimiya, Yuzuru Nishimiya, Yuzuru Nishimiya, Yuzuru Nishimiya, Yuzuru Nishimiya, Yuzuru Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi           Ueno, Naoka Ueno, Naoka Ueno, Naoka Ueno, Naoka Ueno, Naoka Kaneko, Yuuki Kaneko, Yuuki Kaneko, Yuuki Kaneko, Yuuki Kaneko, Yuuki           Nagatsuka, Tomohiro Nagatsuka, Tomohiro Nagatsuka, Tomohiro Nagatsuka, Tomohiro Nagatsuka, Tomohiro Ono, Kensho Ono, Kensho Ono, Kensho Ono, Kensho Ono, Kensho           Ishida, Maria Ishida, Maria Ishida, Maria Ishida, Maria Ishida, Maria Kamata, Erena Kamata, Erena Kamata, Erena Kamata, Erena Kamata, Erena           Pedro Pedro Pedro Pedro Pedro Watanuki, Ryuunosuke Watanuki, Ryuunosuke Watanuki, Ryuunosuke Watanuki, Ryuunosuke Watanuki, Ryuunosuke           Sahara, Miyoko Sahara, Miyoko Sahara, Miyoko Sahara, Miyoko Sahara, Miyoko Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui Ishikawa, Yui           Ishida, Miyako Ishida, Miyako Ishida, Miyako Ishida, Miyako Ishida, Miyako Yukino, Satsuki Yukino, Satsuki Yukino, Satsuki Yukino, Satsuki Yukino, Satsuki           Mashiba, Satoshi Mashiba, Satoshi Mashiba, Satoshi Mashiba, Satoshi Mashiba, Satoshi Toyonaga, Toshiyuki Toyonaga, Toshiyuki Toyonaga, Toshiyuki Toyonaga, Toshiyuki Toyonaga, Toshiyuki           Senami, Riri Senami, Riri Senami, Riri Senami, Riri Senami, Riri      Yamada, Naoko Yamada, Naoko Yamada, Naoko Yamada, Naoko Yamada, Naoko      Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta      Yamamura, Takuya Yamamura, Takuya Yamamura, Takuya Yamamura, Takuya Yamamura, Takuya \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"My Generation (マイ・ジェネレーション)\" by The Who \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko \"Koi wo Shita no wa (恋をしたのは)\" by aiko Shochiku Shochiku Shochiku Shochiku Shochiku Pony Canyon Pony Canyon Pony Canyon Pony Canyon Pony Canyon Kodansha Kodansha Kodansha Kodansha Kodansha ABC Animation ABC Animation ABC Animation ABC Animation ABC Animation Quaras Quaras Quaras Quaras Quaras Eleven Arts Eleven Arts Eleven Arts Eleven Arts Eleven Arts NYAV Post NYAV Post NYAV Post NYAV Post NYAV Post Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Drama Drama Drama Drama Drama School School School School School Shounen Shounen Shounen Shounen Shounen Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation ", "Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa. Kimi no Na wa.  Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.\n\r\nOne day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.\n\nKimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.\n\r\n[Written by MAL Rewrite]\nEnglish: Your Name.\n  \nJapanese: 君の名は。\n       Miyamizu, Mitsuha Miyamizu, Mitsuha Miyamizu, Mitsuha Miyamizu, Mitsuha Miyamizu, Mitsuha Kamishiraishi, Mone Kamishiraishi, Mone Kamishiraishi, Mone Kamishiraishi, Mone Kamishiraishi, Mone           Tachibana, Taki Tachibana, Taki Tachibana, Taki Tachibana, Taki Tachibana, Taki Kamiki, Ryunosuke Kamiki, Ryunosuke Kamiki, Ryunosuke Kamiki, Ryunosuke Kamiki, Ryunosuke           Yukino, Yukari Yukino, Yukari Yukino, Yukari Yukino, Yukari Yukino, Yukari Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana           Okudera, Miki Okudera, Miki Okudera, Miki Okudera, Miki Okudera, Miki Nagasawa, Masami Nagasawa, Masami Nagasawa, Masami Nagasawa, Masami Nagasawa, Masami           Miyamizu, Yotsuha Miyamizu, Yotsuha Miyamizu, Yotsuha Miyamizu, Yotsuha Miyamizu, Yotsuha Tani, Kanon Tani, Kanon Tani, Kanon Tani, Kanon Tani, Kanon           Miyamizu, Hitoha Miyamizu, Hitoha Miyamizu, Hitoha Miyamizu, Hitoha Miyamizu, Hitoha Ichihara, Etsuko Ichihara, Etsuko Ichihara, Etsuko Ichihara, Etsuko Ichihara, Etsuko           Teshigawara, Katsuhiko Teshigawara, Katsuhiko Teshigawara, Katsuhiko Teshigawara, Katsuhiko Teshigawara, Katsuhiko Narita, Ryou Narita, Ryou Narita, Ryou Narita, Ryou Narita, Ryou           Fujii, Tsukasa Fujii, Tsukasa Fujii, Tsukasa Fujii, Tsukasa Fujii, Tsukasa Shimazaki, Nobunaga Shimazaki, Nobunaga Shimazaki, Nobunaga Shimazaki, Nobunaga Shimazaki, Nobunaga           Natori, Sayaka Natori, Sayaka Natori, Sayaka Natori, Sayaka Natori, Sayaka Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi Yuuki, Aoi           Takagi, Shinta Takagi, Shinta Takagi, Shinta Takagi, Shinta Takagi, Shinta Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito           Kawamura, Genki Kawamura, Genki Kawamura, Genki Kawamura, Genki Kawamura, Genki      Shinkai, Makoto Shinkai, Makoto Shinkai, Makoto Shinkai, Makoto Shinkai, Makoto      Yamada, Haru Yamada, Haru Yamada, Haru Yamada, Haru Yamada, Haru      Shinomiya, Yoshitoshi Shinomiya, Yoshitoshi Shinomiya, Yoshitoshi Shinomiya, Yoshitoshi Shinomiya, Yoshitoshi \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Yume Tourou (夢灯籠)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS \"Nandemonaiya (なんでもないや)\" by RADWIMPS Toho Toho Toho Toho Toho Sound Team Don Juan Sound Team Don Juan Sound Team Don Juan Sound Team Don Juan Sound Team Don Juan Amuse Amuse Amuse Amuse Amuse JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications Kadokawa Kadokawa Kadokawa Kadokawa Kadokawa voque ting voque ting voque ting voque ting voque ting Funimation Funimation Funimation Funimation Funimation NYAV Post NYAV Post NYAV Post NYAV Post NYAV Post CoMix Wave Films CoMix Wave Films CoMix Wave Films CoMix Wave Films CoMix Wave Films Romance Romance Romance Romance Romance Supernatural Supernatural Supernatural Supernatural Supernatural School School School School School Drama Drama Drama Drama Drama CoMix Wave Films CoMix Wave Films CoMix Wave Films CoMix Wave Films CoMix Wave Films ", "Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama. Gintama.  After joining the resistance against the bakufu, Gintoki and the gang are in hiding, along with Katsura and his Joui rebels. The Yorozuya is soon approached by Nobume Imai and two members of the Kiheitai, who explain that the Harusame pirates have turned against 7th Division Captain Kamui and their former ally Takasugi. The Kiheitai present Gintoki with a job: find Takasugi, who has been missing since his ship was ambushed in a Harusame raid. Nobume also makes a stunning revelation regarding the Tendoushuu, a secret organization pulling the strings of numerous factions, and their leader Utsuro, the shadowy figure with an uncanny resemblance to Gintoki's former teacher.\n\r\nHitching a ride on Sakamoto's space ship, the Yorozuya and Katsura set out for Rakuyou, Kagura's home planet, where the various factions have gathered and tensions are brewing. Long-held grudges, political infighting, and the Tendoushuu's sinister overarching plan finally culminate into a massive, decisive battle on Rakuyou.\n\r\n[Written by MAL Rewrite]\nEnglish: Gintama Season 5\n  \nSynonyms: Gintama (2017)\n  \nJapanese: 銀魂。\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Kamui Kamui Kamui Kamui Kamui Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi           Elizabeth Elizabeth Elizabeth Elizabeth Elizabeth      Sadaharu Sadaharu Sadaharu Sadaharu Sadaharu Takahashi, Mikako Takahashi, Mikako Takahashi, Mikako Takahashi, Mikako Takahashi, Mikako           Imai, Nobume Imai, Nobume Imai, Nobume Imai, Nobume Imai, Nobume Hirano, Aya Hirano, Aya Hirano, Aya Hirano, Aya Hirano, Aya           Sakamoto, Tatsuma Sakamoto, Tatsuma Sakamoto, Tatsuma Sakamoto, Tatsuma Sakamoto, Tatsuma Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro           Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru      Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji      Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #1: \"Kagerou (カゲロウ)\" by ЯeaL (eps 1-11) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #2: \"SILVER\" by RIZE (ep 12) #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #R1: \"Kyou mo Sakura Mau Akatsuki ni (今日もサクラ舞う暁に)\" by CHiCO with HoneyWorks #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #1: \"SILVER\" by RIZE (eps 1-11) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #2: \"Kagerou (カゲロウ)\" by ЯeaL (ep 12) #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY #R1: \"We Gotta Fight\" by XY TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Shueisha Shueisha Shueisha Shueisha Shueisha add some add some add some add some add some Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Action Action Action Action Action Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Shounen Shounen Shounen Shounen Shounen Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures ", "Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama Gintama  The Amanto, aliens from outer space, have invaded Earth and taken over feudal Japan. As a result, a prohibition on swords has been established, and the samurai of Japan are treated with disregard as a consequence.\n\r\nHowever one man, Gintoki Sakata, still possesses the heart of the samurai, although from his love of sweets and work as a yorozuya, one might not expect it. Accompanying him in his jack-of-all-trades line of work are Shinpachi Shimura, a boy with glasses and a strong heart, Kagura with her umbrella and seemingly bottomless stomach, as well as Sadaharu, their oversized pet dog. Of course, these odd jobs are not always simple, as they frequently have run-ins with the police, ragtag rebels, and assassins, oftentimes leading to humorous but unfortunate consequences.\n\r\nWho said life as an errand boy was easy?\n\r\n[Written by MAL Rewrite]\nEnglish: Gintama\n  \nSynonyms: Gin Tama, Silver Soul, Yorinuki Gintama-san\n  \nJapanese: 銀魂\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Kamui Kamui Kamui Kamui Kamui Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi           Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji Takamatsu, Shinji      Kobayashi, Noriko Kobayashi, Noriko Kobayashi, Noriko Kobayashi, Noriko Kobayashi, Noriko      Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #01: \"Pray\" by Tommy heavenly6 (eps 1-24) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #02: \"Tooi Nioi (遠い匂い)\" by YO-KING (eps 25-49) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #03: \"Giniro no Sora (銀色の空)\" by redballoon (eps 50-75) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #04: \"Kasanaru Kage (かさなる影)\" by Hearts Grow (eps 76-99) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #05: \"DONTEN (曇天)\" by DOES (eps 100-125) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #06: \"Anata MAGIC (アナタMAGIC)\" by monobright (eps 126-150) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #07: \"Stairway Generation\" by Base Ball Bear (eps 151-176) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #08: \"Light Infection\" by Prague (eps 177-201) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bakuchi Dancer (バクチ・ダンサー)\" by DOES (Yorinuki Gintama-san eps 1-9) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R2: \"Kaze no Gotoku (風のごとく)\" by Inoue Joe (Yorinuki Gintama-san eps 10-26) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R3: \"Kanousei Girl (可能性ガール)\" by Chiaki Kuriyama (Yorinuki Gintama-san eps 27-39) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #R4: \"Katoniago (カートニアゴ )\" by FLiP (Yorinuki Gintama-san eps 40-51) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #01: \"Fuusen Gum\" by Captain Straydum (eps 1-13) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #02: \"MR.RAINDROP\" by amplified (eps 14-24) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #03: \"Yuki no Tsubasa\" by redballoon (eps 25-37) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #04: \"Candy Line\" by Hitomi Takahashi (eps 38-49) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #05: \"Shura\" by DOES (eps 50-62) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #06: \"Kiseki\" by Snowkel (eps 63-75) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #07: \"SIGNAL\" by KELUN (eps 76-87) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #08: \"Speed of Flow\" by The Rodeo Carburettor (eps 88-99) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #09: \"Sanagi\" by POSSIBILITY (eps 100-112) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #10: \"This World is yours\" by plingmin (eps 113-125) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #11: \"Ai, Ai, Ai\" by GHOSTNOTE (eps 126-138) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #12: \"Kagayaita\" by SHIGI (eps 139-150) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #13: \"Asa Answer\" by PENGIN (eps 151-163) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #14: \"Wo Ai Ni\" by Hitomi Takahashi feat. Beat Crusaders (eps 164-176) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #15: \"Wonderful Days\" by ONE☆DRAFT (eps 177-189) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #16: \"SAYONARA no Sora\" by Qwai (eps 190-201) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R1: \"Bokutachi no Kisetsu\" by DOES (Yorinuki Gintama-san eps 1-9) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R2: \"Wave\" by Vijandeux (Yorinuki Gintama-san eps 10-26) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R3: \"In My Life\" by AZU (Yorinuki Gintama-san eps 27-39) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) #R4: \"Sakurane\" by Piko (Yorinuki Gintama-san eps 40-51) TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Trinity Sound Trinity Sound Trinity Sound Trinity Sound Trinity Sound Audio Highs Audio Highs Audio Highs Audio Highs Audio Highs Miracle Robo Miracle Robo Miracle Robo Miracle Robo Miracle Robo Shueisha Shueisha Shueisha Shueisha Shueisha Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Crunchyroll Crunchyroll Crunchyroll Crunchyroll Crunchyroll Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Shounen Shounen Shounen Shounen Shounen Sunrise Sunrise Sunrise Sunrise Sunrise ", "Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare  When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\r\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\r\n[Written by MAL Rewrite]\nSynonyms: Gintama: The Final Chapter - Be Forever Yorozuya, Gintama Movie 2\n  \nJapanese: 劇場版 銀魂 完結篇 万事屋よ永遠なれ\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Elizabeth Elizabeth Elizabeth Elizabeth Elizabeth Kamiya, Akira Kamiya, Akira Kamiya, Akira Kamiya, Akira Kamiya, Akira           Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi      Kawamura, Tomoyuki Kawamura, Tomoyuki Kawamura, Tomoyuki Kawamura, Tomoyuki Kawamura, Tomoyuki      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #1: \"Genjou Destruction (現状ディストラクション)\" by SPYAIR #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 #2: \"Pray\" by Tommy heavenly6 TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Bandai Bandai Bandai Bandai Bandai Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan Shueisha Shueisha Shueisha Shueisha Shueisha add some add some add some add some add some Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Shounen Shounen Shounen Shounen Shounen Sunrise Sunrise Sunrise Sunrise Sunrise ", "Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story Clannad: After Story  Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.\n\r\nTime also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World's true purpose.\n\r\nBased on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood.\n\r\n[Written by MAL Rewrite]\nEnglish: Clannad ~After Story~\n  \nJapanese: CLANNAD〜AFTER STORY〜 クラナド アフターストーリー\n       Okazaki, Tomoya Okazaki, Tomoya Okazaki, Tomoya Okazaki, Tomoya Okazaki, Tomoya Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi           Furukawa, Nagisa Furukawa, Nagisa Furukawa, Nagisa Furukawa, Nagisa Furukawa, Nagisa Nakahara, Mai Nakahara, Mai Nakahara, Mai Nakahara, Mai Nakahara, Mai           Okazaki, Ushio Okazaki, Ushio Okazaki, Ushio Okazaki, Ushio Okazaki, Ushio Koorogi, Satomi Koorogi, Satomi Koorogi, Satomi Koorogi, Satomi Koorogi, Satomi           Sakagami, Tomoyo Sakagami, Tomoyo Sakagami, Tomoyo Sakagami, Tomoyo Sakagami, Tomoyo Kuwashima, Houko Kuwashima, Houko Kuwashima, Houko Kuwashima, Houko Kuwashima, Houko           Fujibayashi, Kyou Fujibayashi, Kyou Fujibayashi, Kyou Fujibayashi, Kyou Fujibayashi, Kyou Hirohashi, Ryou Hirohashi, Ryou Hirohashi, Ryou Hirohashi, Ryou Hirohashi, Ryou           Ibuki, Fuuko Ibuki, Fuuko Ibuki, Fuuko Ibuki, Fuuko Ibuki, Fuuko Nonaka, Ai Nonaka, Ai Nonaka, Ai Nonaka, Ai Nonaka, Ai           Furukawa, Akio Furukawa, Akio Furukawa, Akio Furukawa, Akio Furukawa, Akio Okiayu, Ryoutarou Okiayu, Ryoutarou Okiayu, Ryoutarou Okiayu, Ryoutarou Okiayu, Ryoutarou           Ichinose, Kotomi Ichinose, Kotomi Ichinose, Kotomi Ichinose, Kotomi Ichinose, Kotomi Noto, Mamiko Noto, Mamiko Noto, Mamiko Noto, Mamiko Noto, Mamiko           Sunohara, Youhei Sunohara, Youhei Sunohara, Youhei Sunohara, Youhei Sunohara, Youhei Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Furukawa, Sanae Furukawa, Sanae Furukawa, Sanae Furukawa, Sanae Furukawa, Sanae Inoue, Kikuko Inoue, Kikuko Inoue, Kikuko Inoue, Kikuko Inoue, Kikuko           Hatta, Youko Hatta, Youko Hatta, Youko Hatta, Youko Hatta, Youko      Nakamura, Shinichi Nakamura, Shinichi Nakamura, Shinichi Nakamura, Shinichi Nakamura, Shinichi      Ishihara, Tatsuya Ishihara, Tatsuya Ishihara, Tatsuya Ishihara, Tatsuya Ishihara, Tatsuya      Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta Tsuruoka, Youta \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia \"Toki wo Kizamu Uta (時を刻む唄)\" by Lia #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #1: \"TORCH\" by Lia (eps 1-21) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) #2: \"Chiisana Te no Hira (小さなてのひら)\" by riya (ep 22) Pony Canyon Pony Canyon Pony Canyon Pony Canyon Pony Canyon TBS TBS TBS TBS TBS Rakuonsha Rakuonsha Rakuonsha Rakuonsha Rakuonsha Animation Do Animation Do Animation Do Animation Do Animation Do Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Slice of Life Slice of Life Slice of Life Slice of Life Slice of Life Comedy Comedy Comedy Comedy Comedy Supernatural Supernatural Supernatural Supernatural Supernatural Drama Drama Drama Drama Drama Romance Romance Romance Romance Romance Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation Kyoto Animation ", "Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season Owarimonogatari 2nd Season  Following an encounter with oddity specialist Izuko Gaen, third-year high school student Koyomi Araragi wakes up in a strange, deserted void only to be greeted by a joyfully familiar face in an alarmingly unfamiliar place.  \n\r\nAraragi, with the help of his girlfriend Hitagi Senjougahara, maneuvers through the webs of his past and the perplexities of the present in search of answers. However, fate once again delivers him to the eccentric transfer student Ougi Oshino, who brings forth an unexpected proposal that may unearth the very foundation to which he is anchored. As Araragi peels back the layers of mystery surrounding an apparition, he discovers a truth not meant to be revealed.\n\r\n[Written by MAL Rewrite]\nEnglish: Owarimonogatari Second Season\n  \nSynonyms: End Story 2nd Season\n  \nJapanese: 終物語\n       Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Saito, Chiwa Saito, Chiwa Saito, Chiwa Saito, Chiwa Saito, Chiwa           Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi           Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Katou, Emiri Katou, Emiri Katou, Emiri Katou, Emiri Katou, Emiri           Oshino, Ougi Oshino, Ougi Oshino, Ougi Oshino, Ougi Oshino, Ougi Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori           Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya           Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Horie, Yui Horie, Yui Horie, Yui Horie, Yui Horie, Yui           Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga      Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana           Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori           Oshino, Meme Oshino, Meme Oshino, Meme Oshino, Meme Oshino, Meme Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro           Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki      Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki      Kizawa, Yukito Kizawa, Yukito Kizawa, Yukito Kizawa, Yukito Kizawa, Yukito      Nakamoto, Munemasa Nakamoto, Munemasa Nakamoto, Munemasa Nakamoto, Munemasa Nakamoto, Munemasa #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #1: \"terminal terminal\" by Mayoi Hachikuji (Emiri Katou) (TV: ep 1, BD/DVD: eps 1-2) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #2: \"dreamy date drive\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 3-4) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) #3: \"dark cherry mystery\" by Ougi Oshino (Kaori Mizuhashi) (TV: ep 5, BD/DVD: eps 5-7) \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS \"SHIORI\" by ClariS Aniplex Aniplex Aniplex Aniplex Aniplex Kodansha Kodansha Kodansha Kodansha Kodansha Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America Shaft Shaft Shaft Shaft Shaft Mystery Mystery Mystery Mystery Mystery Comedy Comedy Comedy Comedy Comedy Supernatural Supernatural Supernatural Supernatural Supernatural Vampire Vampire Vampire Vampire Vampire Shaft Shaft Shaft Shaft Shaft ", "Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2 Code Geass: Hangyaku no Lelouch R2  One year has passed since the Black Rebellion, a failed uprising against the Holy Britannian Empire led by the masked vigilante Zero, who is now missing. At a loss without their revolutionary leader, Area 11's resistance group—the Black Knights—find themselves too powerless to combat the brutality inflicted upon the Elevens by Britannia, which has increased significantly in order to crush any hope of a future revolt. \n\r\nLelouch Lamperouge, having lost all memory of his double life, is living peacefully alongside his friends as a high school student at Ashford Academy. His former partner C.C., unable to accept this turn of events, takes it upon herself to remind him of his past purpose, hoping that the mastermind Zero will rise once again to finish what he started, in this thrilling conclusion to the series.\n\r\n[Written by MAL Rewrite]\n\nEnglish: Code Geass: Lelouch of the Rebellion R2\n  \nSynonyms: Code Geass: Hangyaku no Lelouch 2nd Season, Code Geass: Hangyaku no Lelouch Second Season\n  \nJapanese: コードギアス 反逆のルルーシュ 続編\n       Lamperouge, Lelouch Lamperouge, Lelouch Lamperouge, Lelouch Lamperouge, Lelouch Lamperouge, Lelouch Fukuyama, Jun Fukuyama, Jun Fukuyama, Jun Fukuyama, Jun Fukuyama, Jun           C.C. C.C. C.C. C.C. C.C. Yukana Yukana Yukana Yukana Yukana           Stadtfeld, Kallen Stadtfeld, Kallen Stadtfeld, Kallen Stadtfeld, Kallen Stadtfeld, Kallen Koshimizu, Ami Koshimizu, Ami Koshimizu, Ami Koshimizu, Ami Koshimizu, Ami           Kururugi, Suzaku Kururugi, Suzaku Kururugi, Suzaku Kururugi, Suzaku Kururugi, Suzaku Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro           Fenette, Shirley Fenette, Shirley Fenette, Shirley Fenette, Shirley Fenette, Shirley Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko Orikasa, Fumiko           Gottwald, Jeremiah Gottwald, Jeremiah Gottwald, Jeremiah Gottwald, Jeremiah Gottwald, Jeremiah Narita, Ken Narita, Ken Narita, Ken Narita, Ken Narita, Ken           Asplund, Lloyd Asplund, Lloyd Asplund, Lloyd Asplund, Lloyd Asplund, Lloyd Shiratori, Tetsu Shiratori, Tetsu Shiratori, Tetsu Shiratori, Tetsu Shiratori, Tetsu           Lamperouge, Rolo Lamperouge, Rolo Lamperouge, Rolo Lamperouge, Rolo Lamperouge, Rolo Mizushima, Takahiro Mizushima, Takahiro Mizushima, Takahiro Mizushima, Takahiro Mizushima, Takahiro           Lamperouge, Nunnally Lamperouge, Nunnally Lamperouge, Nunnally Lamperouge, Nunnally Lamperouge, Nunnally Nazuka, Kaori Nazuka, Kaori Nazuka, Kaori Nazuka, Kaori Nazuka, Kaori           li Britannia, Cornelia li Britannia, Cornelia li Britannia, Cornelia li Britannia, Cornelia li Britannia, Cornelia Minagawa, Junko Minagawa, Junko Minagawa, Junko Minagawa, Junko Minagawa, Junko           Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka      Taniguchi, Gorou Taniguchi, Gorou Taniguchi, Gorou Taniguchi, Gorou Taniguchi, Gorou      Urakami, Yasuo Urakami, Yasuo Urakami, Yasuo Urakami, Yasuo Urakami, Yasuo      Izawa, Motoi Izawa, Motoi Izawa, Motoi Izawa, Motoi Izawa, Motoi #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #1: \"02~O-Two~ (02~ｵｰ･ﾂｰ~)\" by Orange Range (eps 1-12) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #2: \"WORLD END\" by FLOW (eps 13-25) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #1: \"Shiawase Neiro (ｼｱﾜｾﾈｲﾛ)\" by Orange Range (eps 1-12) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) #2: \"Waga Routashi Aku no Hana (わが﨟たし悪の華)\" by ALI PROJECT (eps 13-25) Bandai Visual Bandai Visual Bandai Visual Bandai Visual Bandai Visual Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Bandai Bandai Bandai Bandai Bandai Bandai Namco Entertainment Bandai Namco Entertainment Bandai Namco Entertainment Bandai Namco Entertainment Bandai Namco Entertainment Hakuhodo DY Media Partners Hakuhodo DY Media Partners Hakuhodo DY Media Partners Hakuhodo DY Media Partners Hakuhodo DY Media Partners Funimation Funimation Funimation Funimation Funimation Bandai Entertainment Bandai Entertainment Bandai Entertainment Bandai Entertainment Bandai Entertainment Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Military Military Military Military Military Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Super Power Super Power Super Power Super Power Super Power Drama Drama Drama Drama Drama Mecha Mecha Mecha Mecha Mecha Sunrise Sunrise Sunrise Sunrise Sunrise ", "Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou  After the victory against Aoba Jousai High, Karasuno High School, once called “a fallen powerhouse, a crow that can’t fly,” has finally reached the climax of the heated Spring tournament. Now, to advance to nationals, the Karasuno team has to defeat the powerhouse Shiratorizawa Academy. Karasuno’s greatest hurdle is their adversary’s ace, Wakatoshi Ushijima, the number one player in the Miyagi Prefecture, and one of the country’s top three aces.\n\r\nOnly the strongest team will make it to the national tournament. Since this match is the third-year players’ last chance to qualify for nationals, Karasuno has to use everything they learned during the training camp and prior matches to attain victory. Filled with restlessness and excitement, both teams are determined to come out on top in the third season of Haikyuu!!.\n\r\n[Written by MAL Rewrite] \nEnglish: Haikyu!! 3rd Season\n  \nSynonyms: Haikyuu!! Third Season, Haikyuu!! Karasuno High VS Shiratorizawa Academy\n  \nJapanese: ハイキュー!! 烏野高校 VS 白鳥沢学園高校\n       Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Murase, Ayumu Murase, Ayumu Murase, Ayumu Murase, Ayumu Murase, Ayumu           Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito           Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko           Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke           Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki           Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi           Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei           Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu           Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Osaka, Ryota Osaka, Ryota Osaka, Ryota Osaka, Ryota Osaka, Ryota           Tanaka, Ryuunosuke Tanaka, Ryuunosuke Tanaka, Ryuunosuke Tanaka, Ryuunosuke Tanaka, Ryuunosuke Hayashi, Yuu Hayashi, Yuu Hayashi, Yuu Hayashi, Yuu Hayashi, Yuu           Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi      Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu      Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi      Okuno, Haruo Okuno, Haruo Okuno, Haruo Okuno, Haruo Okuno, Haruo \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Hikari Are (ヒカリアレ)\" by BURNOUT SYNDROMES \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls \"Mashi Mashi (マシ・マシ)\" by NICO Touches the Walls TOHO animation TOHO animation TOHO animation TOHO animation TOHO animation Shueisha Shueisha Shueisha Shueisha Shueisha Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Production I.G Production I.G Production I.G Production I.G Production I.G Comedy Comedy Comedy Comedy Comedy Sports Sports Sports Sports Sports Drama Drama Drama Drama Drama School School School School School Shounen Shounen Shounen Shounen Shounen Production I.G Production I.G Production I.G Production I.G Production I.G ", "Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II Mob Psycho 100 II  Shigeo \"Mob\" Kageyama is now maturing and understanding his role as a supernatural psychic that has the power to drastically affect the livelihood of others. He and his mentor Reigen Arataka continue to deal with supernatural requests from clients, whether it be exorcizing evil spirits or tackling urban legends that haunt the citizens.\n\r\nWhile the workflow remains the same, Mob isn't just blindly following Reigen around anymore. With all his experiences as a ridiculously strong psychic, Mob's supernatural adventures now have more weight to them. Things take on a serious and darker tone as the dangers Mob and Reigen face are much more tangible and unsettling than ever before.\n\r\n[Written by MAL Rewrite]\nEnglish: Mob Psycho 100 II\n  \nSynonyms: Mob Psycho 100 2nd Season, Mob Psycho Hyaku, Mob Psycho One Hundred\n  \nJapanese: モブサイコ100 II\n       Reigen, Arataka Reigen, Arataka Reigen, Arataka Reigen, Arataka Reigen, Arataka Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro           Kageyama, Shigeo Kageyama, Shigeo Kageyama, Shigeo Kageyama, Shigeo Kageyama, Shigeo Itou, Setsuo Itou, Setsuo Itou, Setsuo Itou, Setsuo Itou, Setsuo           Ekubo Ekubo Ekubo Ekubo Ekubo Ootsuka, Akio Ootsuka, Akio Ootsuka, Akio Ootsuka, Akio Ootsuka, Akio           Hanazawa, Teruki Hanazawa, Teruki Hanazawa, Teruki Hanazawa, Teruki Hanazawa, Teruki Matsuoka, Yoshitsugu Matsuoka, Yoshitsugu Matsuoka, Yoshitsugu Matsuoka, Yoshitsugu Matsuoka, Yoshitsugu           Kageyama, Ritsu Kageyama, Ritsu Kageyama, Ritsu Kageyama, Ritsu Kageyama, Ritsu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu           Gouda, Musashi Gouda, Musashi Gouda, Musashi Gouda, Musashi Gouda, Musashi Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko           Kurata, Tome Kurata, Tome Kurata, Tome Kurata, Tome Kurata, Tome Tanezaki, Atsumi Tanezaki, Atsumi Tanezaki, Atsumi Tanezaki, Atsumi Tanezaki, Atsumi           Suzuki, Shou Suzuki, Shou Suzuki, Shou Suzuki, Shou Suzuki, Shou Kokuryu, Sachi Kokuryu, Sachi Kokuryu, Sachi Kokuryu, Sachi Kokuryu, Sachi           Serizawa, Katsuya Serizawa, Katsuya Serizawa, Katsuya Serizawa, Katsuya Serizawa, Katsuya Hoshino, Takanori Hoshino, Takanori Hoshino, Takanori Hoshino, Takanori Hoshino, Takanori           Shimazaki, Ryou Shimazaki, Ryou Shimazaki, Ryou Shimazaki, Ryou Shimazaki, Ryou Sugiyama, Noriaki Sugiyama, Noriaki Sugiyama, Noriaki Sugiyama, Noriaki Sugiyama, Noriaki           Minami, Masahiko Minami, Masahiko Minami, Masahiko Minami, Masahiko Minami, Masahiko      Tachikawa, Yuzuru Tachikawa, Yuzuru Tachikawa, Yuzuru Tachikawa, Yuzuru Tachikawa, Yuzuru      Wakabayashi, Kazuhiro Wakabayashi, Kazuhiro Wakabayashi, Kazuhiro Wakabayashi, Kazuhiro Wakabayashi, Kazuhiro      Fujisawa, Kenichi Fujisawa, Kenichi Fujisawa, Kenichi Fujisawa, Kenichi Fujisawa, Kenichi \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana \"99.9\" by MOB CHOIR feat. sajou no hana #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #1: \"Gray (グレイ)\" by sajou no hana (eps 1, 7) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #2: \"Memosepia (メモセピア)\" by sajou no hana (eps 2-4, 6, 8-12) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #3: \"Mabuta no Ura (目蓋の裏)\" by sajou no hana (ep 5) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) #4: \"Ikiru Hitobito (いきるひとびと)\" by sajou no hana (ep 13) Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan Warner Bros. Japan KlockWorx KlockWorx KlockWorx KlockWorx KlockWorx BS Fuji BS Fuji BS Fuji BS Fuji BS Fuji Hakuhodo DY Music & Pictures Hakuhodo DY Music & Pictures Hakuhodo DY Music & Pictures Hakuhodo DY Music & Pictures Hakuhodo DY Music & Pictures Shogakukan Shogakukan Shogakukan Shogakukan Shogakukan Funimation Funimation Funimation Funimation Funimation Bones Bones Bones Bones Bones Action Action Action Action Action Slice of Life Slice of Life Slice of Life Slice of Life Slice of Life Comedy Comedy Comedy Comedy Comedy Supernatural Supernatural Supernatural Supernatural Supernatural Bones Bones Bones Bones Bones ", "Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen Gintama.: Shirogane no Tamashii-hen - Kouhan-sen  Second Season of the final arc of Gintama.\nEnglish: Gintama.: Silver Soul Arc - Second Half War\n  \nSynonyms: Gintama.: Silver Soul Arc 2\n  \nJapanese: 銀魂. 銀ノ魂篇 後半戦\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo      Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Kamui Kamui Kamui Kamui Kamui Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi Hino, Satoshi           Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru      SPYAIR SPYAIR SPYAIR SPYAIR SPYAIR      HoneyWorks HoneyWorks HoneyWorks HoneyWorks HoneyWorks \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"I Wanna Be...\" by SPYAIR \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks \"Hikari Shoumeiron (ヒカリ証明論)\" by CHiCO with HoneyWorks TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Shueisha Shueisha Shueisha Shueisha Shueisha add some add some add some add some add some Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Action Action Action Action Action Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Shounen Shounen Shounen Shounen Shounen Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures ", "Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi Sen to Chihiro no Kamikakushi  Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way.\n\r\nVivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home.\n\r\n[Written by MAL Rewrite]\nEnglish: Spirited Away\n  \nSynonyms: Sen and Chihiro's Spiriting Away\n  \nJapanese: 千と千尋の神隠し\n       Haku Haku Haku Haku Haku Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu           Ogino, Chihiro Ogino, Chihiro Ogino, Chihiro Ogino, Chihiro Ogino, Chihiro Hiiragi, Rumi Hiiragi, Rumi Hiiragi, Rumi Hiiragi, Rumi Hiiragi, Rumi           Kaonashi Kaonashi Kaonashi Kaonashi Kaonashi Nakamura, Akio Nakamura, Akio Nakamura, Akio Nakamura, Akio Nakamura, Akio           Makkuro-Kurosuke Makkuro-Kurosuke Makkuro-Kurosuke Makkuro-Kurosuke Makkuro-Kurosuke      Kamajii Kamajii Kamajii Kamajii Kamajii Sugawara, Bunta Sugawara, Bunta Sugawara, Bunta Sugawara, Bunta Sugawara, Bunta           Yubaba Yubaba Yubaba Yubaba Yubaba Natsuki, Mari Natsuki, Mari Natsuki, Mari Natsuki, Mari Natsuki, Mari           Lin Lin Lin Lin Lin Tamai, Yumi Tamai, Yumi Tamai, Yumi Tamai, Yumi Tamai, Yumi           Oshira-sama Oshira-sama Oshira-sama Oshira-sama Oshira-sama Yasuda, Ken Yasuda, Ken Yasuda, Ken Yasuda, Ken Yasuda, Ken           Zeniba Zeniba Zeniba Zeniba Zeniba Natsuki, Mari Natsuki, Mari Natsuki, Mari Natsuki, Mari Natsuki, Mari           Ootori-sama Ootori-sama Ootori-sama Ootori-sama Ootori-sama      Suzuki, Toshio Suzuki, Toshio Suzuki, Toshio Suzuki, Toshio Suzuki, Toshio      Ishii, Tomohiko Ishii, Tomohiko Ishii, Tomohiko Ishii, Tomohiko Ishii, Tomohiko      Miyazaki, Hayao Miyazaki, Hayao Miyazaki, Hayao Miyazaki, Hayao Miyazaki, Hayao      Kimura, Youmi Kimura, Youmi Kimura, Youmi Kimura, Youmi Kimura, Youmi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Day of the River/Ano hi no kawa\" by Joe Hisaishi \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura \"Itsumo Nando demo (Always with Me)\" by Yumi Kimura Toho Toho Toho Toho Toho Walt Disney Studios Walt Disney Studios Walt Disney Studios Walt Disney Studios Walt Disney Studios GKIDS GKIDS GKIDS GKIDS GKIDS Studio Ghibli Studio Ghibli Studio Ghibli Studio Ghibli Studio Ghibli Adventure Adventure Adventure Adventure Adventure Supernatural Supernatural Supernatural Supernatural Supernatural Drama Drama Drama Drama Drama Studio Ghibli Studio Ghibli Studio Ghibli Studio Ghibli Studio Ghibli ", "Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen Kizumonogatari III: Reiketsu-hen  After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. \n\r\nAraragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her.\n\r\nBut there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place?\n\r\nAraragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret…\n\r\n[Written by MAL Rewrite]\nSynonyms: Koyomi Vamp, Kizumonogatari Part 3\n  \nJapanese: 傷物語〈Ⅲ冷血篇〉\n       Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya           Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi           Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Horie, Yui Horie, Yui Horie, Yui Horie, Yui Horie, Yui           Oshino, Meme Oshino, Meme Oshino, Meme Oshino, Meme Oshino, Meme Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro Sakurai, Takahiro           Guillotinecutter Guillotinecutter Guillotinecutter Guillotinecutter Guillotinecutter      Shishirui, Seishirou Shishirui, Seishirou Shishirui, Seishirou Shishirui, Seishirou Shishirui, Seishirou      Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki      Oishi, Tatsuya Oishi, Tatsuya Oishi, Tatsuya Oishi, Tatsuya Oishi, Tatsuya      NISIO, ISIN NISIO, ISIN NISIO, ISIN NISIO, ISIN NISIO, ISIN      Yoshinari, You Yoshinari, You Yoshinari, You Yoshinari, You Yoshinari, You \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa \"étoile et toi [édition le blanc]\" by Clémentine & Ainhoa Aniplex Aniplex Aniplex Aniplex Aniplex Kodansha Kodansha Kodansha Kodansha Kodansha add some add some add some add some add some Shaft Shaft Shaft Shaft Shaft Action Action Action Action Action Mystery Mystery Mystery Mystery Mystery Supernatural Supernatural Supernatural Supernatural Supernatural Vampire Vampire Vampire Vampire Vampire Shaft Shaft Shaft Shaft Shaft ", "Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen Gintama.: Shirogane no Tamashii-hen  First Season of the final arc of Gintama.\nEnglish: Gintama.: Silver Soul Arc\n  \nJapanese: 銀魂. 銀ノ魂篇\n       Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sakata, Gintoki Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu Sugita, Tomokazu           Kagura Kagura Kagura Kagura Kagura Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie Kugimiya, Rie           Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Shimura, Shinpachi Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke Sakaguchi, Daisuke           Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Hijikata, Toushirou Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya Nakai, Kazuya           Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Katsura, Kotarou Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Okita, Sougo Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi Suzumura, Kenichi           Tsukuyo Tsukuyo Tsukuyo Tsukuyo Tsukuyo Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko Kaida, Yuuko           Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Hasegawa, Taizou Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko Tachiki, Fumihiko           Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Takasugi, Shinsuke Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Elizabeth Elizabeth Elizabeth Elizabeth Elizabeth      Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi Fujita, Youichi      Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru Miyawaki, Chizuru      BURNOUT SYNDROMES BURNOUT SYNDROMES BURNOUT SYNDROMES BURNOUT SYNDROMES BURNOUT SYNDROMES      DISH// DISH// DISH// DISH// DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Katte ni My Soul (勝手にMY SOUL)\" by DISH// \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES \"Hana Ichi Monme (花一匁)\" by BURNOUT SYNDROMES TV Tokyo TV Tokyo TV Tokyo TV Tokyo TV Tokyo Aniplex Aniplex Aniplex Aniplex Aniplex Dentsu Dentsu Dentsu Dentsu Dentsu Shueisha Shueisha Shueisha Shueisha Shueisha add some add some add some add some add some Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Action Action Action Action Action Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Comedy Comedy Comedy Comedy Comedy Historical Historical Historical Historical Historical Parody Parody Parody Parody Parody Samurai Samurai Samurai Samurai Samurai Shounen Shounen Shounen Shounen Shounen Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures Bandai Namco Pictures ", "Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop Cowboy Bebop  In the year 2071, humanity has colonized several of the planets and moons of the solar system leaving the now uninhabitable surface of planet Earth behind. The Inter Solar System Police attempts to keep peace in the galaxy, aided in part by outlaw bounty hunters, referred to as \"Cowboys.\" The ragtag team aboard the spaceship Bebop are two such individuals.\n\r\nMellow and carefree Spike Spiegel is balanced by his boisterous, pragmatic partner Jet Black as the pair makes a living chasing bounties and collecting rewards. Thrown off course by the addition of new members that they meet in their travels—Ein, a genetically engineered, highly intelligent Welsh Corgi; femme fatale Faye Valentine, an enigmatic trickster with memory loss; and the strange computer whiz kid Edward Wong—the crew embarks on thrilling adventures that unravel each member's dark and mysterious past little by little.\n\r\nWell-balanced with high density action and light-hearted comedy, Cowboy Bebop is a space Western classic and an homage to the smooth and improvised music it is named after.\n\r\n[Written by MAL Rewrite]\nEnglish: Cowboy Bebop\n  \nJapanese: カウボーイビバップ\n       Spiegel, Spike Spiegel, Spike Spiegel, Spike Spiegel, Spike Spiegel, Spike Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi           Valentine, Faye Valentine, Faye Valentine, Faye Valentine, Faye Valentine, Faye Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi           Wong Hau Pepelu Tivrusky IV, Edward Wong Hau Pepelu Tivrusky IV, Edward Wong Hau Pepelu Tivrusky IV, Edward Wong Hau Pepelu Tivrusky IV, Edward Wong Hau Pepelu Tivrusky IV, Edward Tada, Aoi Tada, Aoi Tada, Aoi Tada, Aoi Tada, Aoi           Black, Jet Black, Jet Black, Jet Black, Jet Black, Jet Ishizuka, Unshou Ishizuka, Unshou Ishizuka, Unshou Ishizuka, Unshou Ishizuka, Unshou           Ein Ein Ein Ein Ein Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi           Vicious Vicious Vicious Vicious Vicious Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio Wakamoto, Norio           Julia Julia Julia Julia Julia Takashima, Gara Takashima, Gara Takashima, Gara Takashima, Gara Takashima, Gara           Eckener, Grencia Mars Elijah Guo Eckener, Grencia Mars Elijah Guo Eckener, Grencia Mars Elijah Guo Eckener, Grencia Mars Elijah Guo Eckener, Grencia Mars Elijah Guo Horiuchi, Kenyuu Horiuchi, Kenyuu Horiuchi, Kenyuu Horiuchi, Kenyuu Horiuchi, Kenyuu           Von de Oniyate, Andy Von de Oniyate, Andy Von de Oniyate, Andy Von de Oniyate, Andy Von de Oniyate, Andy Ebara, Masashi Ebara, Masashi Ebara, Masashi Ebara, Masashi Ebara, Masashi           Mad Pierrot Mad Pierrot Mad Pierrot Mad Pierrot Mad Pierrot Ginga, Banjou Ginga, Banjou Ginga, Banjou Ginga, Banjou Ginga, Banjou           Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka Maseba, Yutaka      Minami, Masahiko Minami, Masahiko Minami, Masahiko Minami, Masahiko Minami, Masahiko      Watanabe, Shinichiro Watanabe, Shinichiro Watanabe, Shinichiro Watanabe, Shinichiro Watanabe, Shinichiro      Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi Kobayashi, Katsuyoshi \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) \"Tank!\" by The Seatbelts (eps 1-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #1: \"The Real Folk Blues\" by The Seatbelts feat. Mai Yamane (eps 1-12, 14-25) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #2: \"Space Lion\" by The Seatbelts (ep 13) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) #3: \"Blue\" by The Seatbelts feat. Mai Yamane (ep 26) Bandai Visual Bandai Visual Bandai Visual Bandai Visual Bandai Visual Funimation Funimation Funimation Funimation Funimation Bandai Entertainment Bandai Entertainment Bandai Entertainment Bandai Entertainment Bandai Entertainment Sunrise Sunrise Sunrise Sunrise Sunrise Action Action Action Action Action Adventure Adventure Adventure Adventure Adventure Comedy Comedy Comedy Comedy Comedy Drama Drama Drama Drama Drama Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Space Space Space Space Space Sunrise Sunrise Sunrise Sunrise Sunrise ", "Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen Kaguya-sama wa Kokurasetai?: Tensai-tachi no Renai Zunousen  After a slow but eventful summer vacation, Shuchiin Academy's second term is now starting in full force. As August transitions into September, Miyuki Shirogane's birthday looms ever closer, leaving Kaguya Shinomiya in a serious predicament as to how to celebrate it. Furthermore, the tenure of the school's 67th student council is coming to an end. Due to the council members being in different classes, the only time Kaguya and Miyuki have to be together will soon disappear, putting all of their cunning plans at risk.\n\r\nA long and difficult election that will decide the fate of the new student council awaits, as multiple challengers fight for the coveted title of president.\n\r\n[Written by MAL Rewrite]\n\nEnglish: Kaguya-sama: Love is War Season 2\n  \nSynonyms: Kaguya Wants to be Confessed To: The Geniuses' War of Love and Brains 2nd Season, Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen 2nd Season, Kaguya-sama: Love is War 2nd Season\n  \nJapanese: かぐや様は告らせたい？～天才たちの恋愛頭脳戦～\n       Ishigami, Yuu Ishigami, Yuu Ishigami, Yuu Ishigami, Yuu Ishigami, Yuu Suzuki, Ryouta Suzuki, Ryouta Suzuki, Ryouta Suzuki, Ryouta Suzuki, Ryouta           Fujiwara, Chika Fujiwara, Chika Fujiwara, Chika Fujiwara, Chika Fujiwara, Chika Kohara, Konomi Kohara, Konomi Kohara, Konomi Kohara, Konomi Kohara, Konomi           Shinomiya, Kaguya Shinomiya, Kaguya Shinomiya, Kaguya Shinomiya, Kaguya Shinomiya, Kaguya Koga, Aoi Koga, Aoi Koga, Aoi Koga, Aoi Koga, Aoi           Iino, Miko Iino, Miko Iino, Miko Iino, Miko Iino, Miko Tomita, Miyu Tomita, Miyu Tomita, Miyu Tomita, Miyu Tomita, Miyu           Shirogane, Miyuki Shirogane, Miyuki Shirogane, Miyuki Shirogane, Miyuki Shirogane, Miyuki Furukawa, Makoto Furukawa, Makoto Furukawa, Makoto Furukawa, Makoto Furukawa, Makoto           Hayasaka, Ai Hayasaka, Ai Hayasaka, Ai Hayasaka, Ai Hayasaka, Ai Hanamori, Yumiri Hanamori, Yumiri Hanamori, Yumiri Hanamori, Yumiri Hanamori, Yumiri           Shirogane, Kei Shirogane, Kei Shirogane, Kei Shirogane, Kei Shirogane, Kei Suzushiro, Sayumi Suzushiro, Sayumi Suzushiro, Sayumi Suzushiro, Sayumi Suzushiro, Sayumi           Shirogane, Father Shirogane, Father Shirogane, Father Shirogane, Father Shirogane, Father Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito Koyasu, Takehito           Narrator Narrator Narrator Narrator Narrator Aoyama, Yutaka Aoyama, Yutaka Aoyama, Yutaka Aoyama, Yutaka Aoyama, Yutaka           Shijou, Maki Shijou, Maki Shijou, Maki Shijou, Maki Shijou, Maki Ichinose, Kana Ichinose, Kana Ichinose, Kana Ichinose, Kana Ichinose, Kana           Omata, Shinichi Omata, Shinichi Omata, Shinichi Omata, Shinichi Omata, Shinichi      Aketagawa, Jin Aketagawa, Jin Aketagawa, Jin Aketagawa, Jin Aketagawa, Jin      Fukuhara, Haruka Fukuhara, Haruka Fukuhara, Haruka Fukuhara, Haruka Fukuhara, Haruka      Akasaka, Aka Akasaka, Aka Akasaka, Aka Akasaka, Aka Akasaka, Aka \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 2-10) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #1: \"DADDY! DADDY! DO! feat. Airi Suzuki (DADDY! DADDY! DO! feat. 鈴木愛理)\" by Masayuki Suzuki (eps 1, 12) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) #2: \"Kaze ni Fukarete (風に吹かれて)\" by Haruka Fukuhara (eps 2-4, 6-11) Aniplex Aniplex Aniplex Aniplex Aniplex Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Shueisha Shueisha Shueisha Shueisha Shueisha JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications JR East Marketing & Communications Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America A-1 Pictures A-1 Pictures A-1 Pictures A-1 Pictures A-1 Pictures Comedy Comedy Comedy Comedy Comedy Psychological Psychological Psychological Psychological Psychological Romance Romance Romance Romance Romance School School School School School Seinen Seinen Seinen Seinen Seinen A-1 Pictures A-1 Pictures A-1 Pictures A-1 Pictures A-1 Pictures ", "Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen  Even after having risen to the utmost rank of shun'ichi, Yotaro struggles to find his own identity in the world of rakugo. Caught between his master's teachings and the late Sukeroku's unique style, his performance lacks an important ingredient—ego. And while his popularity packs the theaters, he is but one of the few; rakugo is under threat of being eclipsed.\n\r\nMeanwhile Yakumo, regarded by many as the last bastion of preserving the popularity of rakugo, struggles to cope with his elderly state. Even though his performances are still stellar, he fears that he is nearing his limits. His doubts grow stronger as an old friend creeps ever closer. Konatsu, for her part, attempts to raise her son as a single mother, which Yotaro is heavily opposed to. Instead, he seeks to persuade her to marry him and in turn raise her son as his own.\n\r\nIn Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, the curtains fall on Yotaro and Yakumo's story, tasked with restoring the near-obsolete art form as well as overcoming their internal conflicts.\n\r\n[Written by MAL Rewrite]\nEnglish: Descending Stories: Showa Genroku Rakugo Shinju\n  \nSynonyms: Shouwa Genroku Rakugo Shinjuu 2nd Season, Showa and Genroku Era Lover's Suicide Through Rakugo 2nd Season\n  \nJapanese: 昭和元禄落語心中～助六再び篇～\n       Yuurakutei, Yakumo Yuurakutei, Yakumo Yuurakutei, Yakumo Yuurakutei, Yakumo Yuurakutei, Yakumo Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira Ishida, Akira           Yotarou Yotarou Yotarou Yotarou Yotarou Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu Seki, Tomokazu           Yuurakutei, Sukeroku Yuurakutei, Sukeroku Yuurakutei, Sukeroku Yuurakutei, Sukeroku Yuurakutei, Sukeroku Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi Yamadera, Kouichi           Konatsu Konatsu Konatsu Konatsu Konatsu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu Kobayashi, Yuu           Miyokichi Miyokichi Miyokichi Miyokichi Miyokichi Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi Hayashibara, Megumi           Matsuda Matsuda Matsuda Matsuda Matsuda Ushiyama, Shigeru Ushiyama, Shigeru Ushiyama, Shigeru Ushiyama, Shigeru Ushiyama, Shigeru           Shinnosuke Shinnosuke Shinnosuke Shinnosuke Shinnosuke Komatsu, Mikako Komatsu, Mikako Komatsu, Mikako Komatsu, Mikako Komatsu, Mikako           Tsuburaya, Mangetsu Tsuburaya, Mangetsu Tsuburaya, Mangetsu Tsuburaya, Mangetsu Tsuburaya, Mangetsu Yusa, Kouji Yusa, Kouji Yusa, Kouji Yusa, Kouji Yusa, Kouji           Higuchi, Eisuke Higuchi, Eisuke Higuchi, Eisuke Higuchi, Eisuke Higuchi, Eisuke Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko Seki, Toshihiko           Koyuki Koyuki Koyuki Koyuki Koyuki Asai, Ayaka Asai, Ayaka Asai, Ayaka Asai, Ayaka Asai, Ayaka           Omata, Shinichi Omata, Shinichi Omata, Shinichi Omata, Shinichi Omata, Shinichi      Andou, Takashi Andou, Takashi Andou, Takashi Andou, Takashi Andou, Takashi      Kimura, Nobukage Kimura, Nobukage Kimura, Nobukage Kimura, Nobukage Kimura, Nobukage      Nakanishi, Yasuhiro Nakanishi, Yasuhiro Nakanishi, Yasuhiro Nakanishi, Yasuhiro Nakanishi, Yasuhiro \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) \"Imawa no Shinigami (今際の死神)\" by Megumi Hayashibara (eps 2, 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #1: \"Hikobayuru (ひこばゆる)\" by Kana Shibue (eps 4-10) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) #2: \"Kawa, Taredoki (かは、たれどき)\" by Kana Shibue (ep 12) Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Mainichi Broadcasting System Kodansha Kodansha Kodansha Kodansha Kodansha DAX Production DAX Production DAX Production DAX Production DAX Production King Records King Records King Records King Records King Records add some add some add some add some add some Studio Deen Studio Deen Studio Deen Studio Deen Studio Deen Drama Drama Drama Drama Drama Historical Historical Historical Historical Historical Josei Josei Josei Josei Josei Studio Deen Studio Deen Studio Deen Studio Deen Studio Deen ", "Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei Made in Abyss Movie 3: Fukaki Tamashii no Reimei  Made in Abyss Movie 3: Fukaki Tamashii no Reimei continues the epic adventure of Riko and Reg who are joined by their new friend Nanachi. Together, they descend into the Abyss' treacherous fifth layer, the Sea of Corpses, and encounter the mysterious Bondrewd, a legendary White Whistle whose shadow looms over Nanachi's troubled past. Bondrewd is ingratiatingly hospitable, but the brave adventurers know things are not always as they seem in the enigmatic Abyss...\n\r\n(Source: Sentai Filmworks, edited)\nSynonyms: Gekijouban Made in Abyss: Fukaki Tamashii no Reimei, Made in Abyss: Dawn of the Deep Soul\n  \nJapanese: 劇場版メイドインアビス 深き魂の黎明\n       Nanachi Nanachi Nanachi Nanachi Nanachi Izawa, Shiori Izawa, Shiori Izawa, Shiori Izawa, Shiori Izawa, Shiori           Regu Regu Regu Regu Regu      Riko Riko Riko Riko Riko      Bondrewd Bondrewd Bondrewd Bondrewd Bondrewd      Prushka Prushka Prushka Prushka Prushka      Kojima, Masayuki Kojima, Masayuki Kojima, Masayuki Kojima, Masayuki Kojima, Masayuki      Penkin, Kevin Penkin, Kevin Penkin, Kevin Penkin, Kevin Penkin, Kevin      Tsukushi, Akihito Tsukushi, Akihito Tsukushi, Akihito Tsukushi, Akihito Tsukushi, Akihito      Kise, Kazuchika Kise, Kazuchika Kise, Kazuchika Kise, Kazuchika Kise, Kazuchika \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID \"Forever Lost\" by MYTH & ROID add some add some add some add some add some Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Kinema Citrus Kinema Citrus Kinema Citrus Kinema Citrus Kinema Citrus Adventure Adventure Adventure Adventure Adventure Drama Drama Drama Drama Drama Fantasy Fantasy Fantasy Fantasy Fantasy Mystery Mystery Mystery Mystery Mystery Sci-Fi Sci-Fi Sci-Fi Sci-Fi Sci-Fi Kinema Citrus Kinema Citrus Kinema Citrus Kinema Citrus Kinema Citrus ", "Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season Monogatari Series: Second Season  Apparitions, oddities, and gods continue to manifest around Koyomi Araragi and his close-knit group of friends: Tsubasa Hanekawa, the group's modest genius; Shinobu Oshino, the resident doughnut-loving vampire; athletic deviant Suruga Kanbaru; bite-happy spirit Mayoi Hachikuji; Koyomi's cutesy stalker Nadeko Sengoku; and Hitagi Senjogahara, the poignant tsundere.\n\nMonogatari Series: Second Season revolves around these individuals and their struggle to overcome the darkness that is rapidly approaching. A new semester has begun and with graduation looming over Araragi, he must quickly decide the paths he will walk, as well as the relationships and friends that he'll save. But as strange events begin to unfold, Araragi is nowhere to be found, and a vicious tiger apparition has appeared in his absence. Hanekawa has become its target, and she must fend for herself—or bow to the creature's perspective on the feebleness of humanity.\n\r\n[Written by MAL Rewrite]\nEnglish: Monogatari Series: Second Season\n  \nSynonyms: Nekomonogatari: Shiro, Kabukimonogatari: Mayoi Jianshi, Otorimonogatari, Onimonogatari, Koimonogatari\n  \nJapanese: 〈物語〉シリーズ セカンドシーズン\n       Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Senjougahara, Hitagi Saito, Chiwa Saito, Chiwa Saito, Chiwa Saito, Chiwa Saito, Chiwa           Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Oshino, Shinobu Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya Sakamoto, Maaya           Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Araragi, Koyomi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi Kamiya, Hiroshi           Kaiki, Deishuu Kaiki, Deishuu Kaiki, Deishuu Kaiki, Deishuu Kaiki, Deishuu Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro Miki, Shinichiro           Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Hanekawa, Tsubasa Horie, Yui Horie, Yui Horie, Yui Horie, Yui Horie, Yui           Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Hachikuji, Mayoi Katou, Emiri Katou, Emiri Katou, Emiri Katou, Emiri Katou, Emiri           Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Sengoku, Nadeko Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana Hanazawa, Kana           Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga Kanbaru, Suruga Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki Sawashiro, Miyuki           Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Ononoki, Yotsugi Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori Hayami, Saori           Oshino, Ougi Oshino, Ougi Oshino, Ougi Oshino, Ougi Oshino, Ougi Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori Mizuhashi, Kaori           Iwakami, Atsuhiro Iwakami, Atsuhiro Iwakami, Atsuhiro Iwakami, Atsuhiro Iwakami, Atsuhiro      Kubota, Mitsutoshi Kubota, Mitsutoshi Kubota, Mitsutoshi Kubota, Mitsutoshi Kubota, Mitsutoshi      Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki Shinbou, Akiyuki      Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki Itamura, Tomoyuki #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #1: \"chocolate insomnia\" by Tsubasa Hanekawa (Yui Horie) (TV: eps 1-2, 4; BD/DVD: eps 1-5) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #2: \"happy bite\" by Mayoi Hachikuji (Emiri Kato) (TV: eps 8-9; BD/DVD: eps 7-10) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #3: \"Mousou♡Express (もうそう♡えくすぷれす)\" by Nadeko Sengoku (Kana Hanazawa) (TV: eps 12, 14; BD/DVD: eps 12-15) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #4: \"white lies\" by Hiroaki Miyakoshi and Shigeru Yamada (Tokyo Philharmonic Chorus) (BD/DVD: eps 17-20) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #5: \"fast love\" by Hitagi Senjougahara (Chiwa Saito) (BD/DVD: eps 21-23) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #6: \"Kogarashi Sentiment (木枯らしセンティメント)\" by Hitagi Senjougahara (Chiwa Saito) and Deishu Kaiki (Shinichiro Miki) (TV: eps 23-25; BD/DVD: eps 24-26) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #1: \"Ai wo Utae (アイヲウタエ)\" by Luna Haruna (eps 1-10) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #2: \"Kimi no Shiranai Monogatari (君の知らない物語)\" by supercell (ep 11) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #3: \"Sono Koe wo Oboeteru (その声を覚えてる)\" by Marina Kawano (eps 12-20) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) #4: \"snowdrop\" by Luna Haruna × Marina Kawano (eps 21-25) Aniplex Aniplex Aniplex Aniplex Aniplex Kodansha Kodansha Kodansha Kodansha Kodansha Cyclone Graphics Cyclone Graphics Cyclone Graphics Cyclone Graphics Cyclone Graphics Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America Shaft Shaft Shaft Shaft Shaft Mystery Mystery Mystery Mystery Mystery Comedy Comedy Comedy Comedy Comedy Supernatural Supernatural Supernatural Supernatural Supernatural Romance Romance Romance Romance Romance Vampire Vampire Vampire Vampire Vampire Shaft Shaft Shaft Shaft Shaft ", "Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season Haikyuu!! Second Season  Following their participation at the Inter-High, the Karasuno High School volleyball team attempts to refocus their efforts, aiming to conquer the Spring tournament instead. \n\r\nWhen they receive an invitation from long-standing rival Nekoma High, Karasuno agrees to take part in a large training camp alongside many notable volleyball teams in Tokyo and even some national level players. By playing with some of the toughest teams in Japan, they hope not only to sharpen their skills, but also come up with new attacks that would strengthen them. Moreover, Hinata and Kageyama attempt to devise a more powerful weapon, one that could possibly break the sturdiest of blocks. \n\r\nFacing what may be their last chance at victory before the senior players graduate, the members of Karasuno's volleyball team must learn to settle their differences and train harder than ever if they hope to overcome formidable opponents old and new—including their archrival Aoba Jousai and its world-class setter Tooru Oikawa.\n\r\n[Written by MAL Rewrite]\nEnglish: Haikyu!! 2nd Season\n  \nSynonyms: Haikyuu!! Second Season\n  \nJapanese: ハイキュー!! セカンドシーズン\n       Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Hinata, Shouyou Murase, Ayumu Murase, Ayumu Murase, Ayumu Murase, Ayumu Murase, Ayumu           Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Kageyama, Tobio Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito Ishikawa, Kaito           Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Nishinoya, Yuu Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko Okamoto, Nobuhiko           Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Oikawa, Tooru Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke Namikawa, Daisuke           Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Tsukishima, Kei Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki Uchiyama, Kouki           Kozume, Kenma Kozume, Kenma Kozume, Kenma Kozume, Kenma Kozume, Kenma Kaji, Yuki Kaji, Yuki Kaji, Yuki Kaji, Yuki Kaji, Yuki           Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Kuroo, Tetsurou Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi Nakamura, Yuuichi           Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Bokuto, Koutarou Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei Kimura, Ryouhei           Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Sugawara, Koushi Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu Irino, Miyu           Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Akaashi, Keiji Osaka, Ryota Osaka, Ryota Osaka, Ryota Osaka, Ryota Osaka, Ryota           Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi Morihiro, Fumi      Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu Mitsunaka, Susumu      Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi Kikuta, Hiromi      Koyama, Yoshitaka Koyama, Yoshitaka Koyama, Yoshitaka Koyama, Yoshitaka Koyama, Yoshitaka #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #1: \"I'm A Believer (アイム・ア・ビリーバー)\" by SPYAIR (eps 1-13) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #2: \"FLY HIGH!!\" by BURNOUT SYNDROMES (eps 14-25) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #1: \"Climber (クライマー)\" by Galileo Galilei (eps 1-13) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) #2: \"Hatsunetsu (発熱)\" by tacica  (eps 14-25) TOHO animation TOHO animation TOHO animation TOHO animation TOHO animation Shueisha Shueisha Shueisha Shueisha Shueisha Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Sentai Filmworks Production I.G Production I.G Production I.G Production I.G Production I.G Comedy Comedy Comedy Comedy Comedy Sports Sports Sports Sports Sports Drama Drama Drama Drama Drama School School School School School Shounen Shounen Shounen Shounen Shounen Production I.G Production I.G Production I.G Production I.G Production I.G ", "Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season Mushishi Zoku Shou 2nd Season  Ghostly, primordial beings known as Mushi continue to cause mysterious changes in the lives of humans. The travelling Mushishi, Ginko, persists in trying to set right the strange and unsettling situations he encounters. Time loops, living shadows, and telepathy are among the overt effects of interference from Mushi, but more subtle symptoms that take years to be noticed also rouse Ginko's concern as he passes from village to village.\n\r\nThrough circumstance, Ginko has become an arbiter, determining which Mushi are blessings and which are curses. But the lines that he seeks to draw are subjective. Some of his patients would rather exercise their new powers until they are utterly consumed by them; others desperately strive to rid themselves of afflictions which are in fact protecting their lives from devastation. Those who cross paths with Mushi must learn to accept seemingly impossible consequences for their actions, and heal wounds they did not know they had. Otherwise, they risk meeting with fates beyond their comprehension.\n\r\n[Written by MAL Rewrite]\nSynonyms: Mushishi Zoku Shou 2nd Season\n  \nJapanese: 蟲師 続章\n       Ginko Ginko Ginko Ginko Ginko Nakano, Yuto Nakano, Yuto Nakano, Yuto Nakano, Yuto Nakano, Yuto           Narrator Narrator Narrator Narrator Narrator Doi, Mika Doi, Mika Doi, Mika Doi, Mika Doi, Mika           Shino Shino Shino Shino Shino Kobashi, Megumi Kobashi, Megumi Kobashi, Megumi Kobashi, Megumi Kobashi, Megumi           Kaoru Kaoru Kaoru Kaoru Kaoru Furukawa, Toshio Furukawa, Toshio Furukawa, Toshio Furukawa, Toshio Furukawa, Toshio           Akane Akane Akane Akane Akane      Youkichi Youkichi Youkichi Youkichi Youkichi Nishimura, Tomomichi Nishimura, Tomomichi Nishimura, Tomomichi Nishimura, Tomomichi Nishimura, Tomomichi           Suguro Suguro Suguro Suguro Suguro Nakao, Ryusei Nakao, Ryusei Nakao, Ryusei Nakao, Ryusei Nakao, Ryusei           Mikage Mikage Mikage Mikage Mikage Suzuki, Reiko Suzuki, Reiko Suzuki, Reiko Suzuki, Reiko Suzuki, Reiko           Gen Gen Gen Gen Gen      Isaza Isaza Isaza Isaza Isaza      Nagahama, Hiroshi Nagahama, Hiroshi Nagahama, Hiroshi Nagahama, Hiroshi Nagahama, Hiroshi      Rose, Lucy Rose, Lucy Rose, Lucy Rose, Lucy Rose, Lucy      Urushibara, Yuki Urushibara, Yuki Urushibara, Yuki Urushibara, Yuki Urushibara, Yuki      Masuda, Toshio Masuda, Toshio Masuda, Toshio Masuda, Toshio Masuda, Toshio \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose \"SHIVER\" by Lucy Rose #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #01: \"Kusa no Shitone (草の茵)\" by Toshio Masuda (ep 1) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #02: \"Kaoru Yami (香る闇)\" by Toshio Masuda (ep 2) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #03: \"Nokori Beni (残り紅)\" by Toshio Masuda (ep 3) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #04: \"Komori E (隠り江)\" by Toshio Masuda (ep 4) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #05: \"Hikari no Ou (光の緒)\" by Toshio Masuda (ep 5) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #06: \"Koten no Hoshi (壺天の星)\" by Toshio Masuda (ep 6) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #07: \"Mizu Aomu (水碧む)\" by Toshio Masuda (ep 7) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #08: \"Ikatsuchi no Tamoto (雷の袂)\" by Toshio Masuda (ep 8) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #09: \"Doro no Kusa\" (泥の草) by Toshio Masuda (ep 9) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) #10: \"Tokoshie no Ki\" (常の樹) by Toshio Masuda (ep 10) Aniplex Aniplex Aniplex Aniplex Aniplex Kodansha Kodansha Kodansha Kodansha Kodansha Delfi Sound Delfi Sound Delfi Sound Delfi Sound Delfi Sound Aniplex of America Aniplex of America Aniplex of America Aniplex of America Aniplex of America Artland Artland Artland Artland Artland Adventure Adventure Adventure Adventure Adventure Fantasy Fantasy Fantasy Fantasy Fantasy Historical Historical Historical Historical Historical Mystery Mystery Mystery Mystery Mystery Seinen Seinen Seinen Seinen Seinen Slice of Life Slice of Life Slice of Life Slice of Life Slice of Life Supernatural Supernatural Supernatural Supernatural Supernatural Artland Artland Artland Artland Artland "]